## Lam sach du lieu co ban

## 1. Tao du lieu

In [2]:
import pandas as pd

data = {
    "id": [1, 2, 3, 4, 5, 6],
    "Ten": ["Anh", "Phong", "Em", "Phu", None, None],  
    "Tuoi": [15, 14, 16, 28, None, None],  
    "Email": ["khang.2274802010384@vanlanguni.vn", "khang682004@gmail.com", "phu@yahoo.com.vn", "em@gmail.com", None, None],
    "salary": [None, 7000000, 10000, 800000, 150000, None]  
}

df = pd.DataFrame(data)
print(df)

   id    Ten  Tuoi                              Email     salary
0   1    Anh  15.0  khang.2274802010384@vanlanguni.vn        NaN
1   2  Phong  14.0              khang682004@gmail.com  7000000.0
2   3     Em  16.0                   phu@yahoo.com.vn    10000.0
3   4    Phu  28.0                       em@gmail.com   800000.0
4   5   None   NaN                               None   150000.0
5   6   None   NaN                               None        NaN

In [3]:
# Lay ten dang nhap
df.head()

   id    Ten  Tuoi                              Email     salary
0   1    Anh  15.0  khang.2274802010384@vanlanguni.vn        NaN
1   2  Phong  14.0              khang682004@gmail.com  7000000.0
2   3     Em  16.0                   phu@yahoo.com.vn    10000.0
3   4    Phu  28.0                       em@gmail.com   800000.0
4   5   None   NaN                               None   150000.0

In [4]:
# Kiem tra du lieu bi thieu
df.isnull().sum()

id        0
Ten       2
Tuoi      2
Email     2
salary    2
dtype: int64

In [8]:
# Dien gia tri thieu bang gia tri trung binh cho cot salary
df["salary"].fillna(df["salary"].mean(), inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_9608\4089966279.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean(), inplace=True)

In [10]:
# Gia tri thieu bang unknow cho cot "name" va cot "email"
df["Ten"].fillna("unknow", inplace=True)
df["Email"].fillna("unknow", inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_9608\3646958442.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Ten"].fillna("unknow", inplace=True)
C:\Users\Admin\AppData\Local\Temp\ipykernel_9608\3646958442.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Email"].fillna("unknow", inplace=True)

In [11]:
# Kiem tra du lieu bi thieu
df.isnull().sum()

id        0
Ten       0
Tuoi      2
Email     0
salary    0
dtype: int64

In [12]:
df.head()

   id     Ten  Tuoi                              Email     salary
0   1     Anh  15.0  khang.2274802010384@vanlanguni.vn  1990000.0
1   2   Phong  14.0              khang682004@gmail.com  7000000.0
2   3      Em  16.0                   phu@yahoo.com.vn    10000.0
3   4     Phu  28.0                       em@gmail.com   800000.0
4   5  unknow   NaN                             unknow   150000.0

In [13]:
# Chuan hoa cot Ten bang cach viet hoa chu cai dau
df["Ten"] = df["Ten"].str.title()

In [14]:
# Chuyen hoa cot email bang cach chuyen ve chu thuong
df["Email"] = df["Email"].str.lower()

df

   id     Ten  Tuoi                              Email     salary
0   1     Anh  15.0  khang.2274802010384@vanlanguni.vn  1990000.0
1   2   Phong  14.0              khang682004@gmail.com  7000000.0
2   3      Em  16.0                   phu@yahoo.com.vn    10000.0
3   4     Phu  28.0                       em@gmail.com   800000.0
4   5  Unknow   NaN                             unknow   150000.0
5   6  Unknow   NaN                             unknow  1990000.0

In [15]:
#Luu du lieu da lam sach
df.to_csv("Dulieulamsach.csv", index=False)

# Bai tap ve nha

### Cho du lieu dirty_data.csv
1. Kiem tra du lieu thieu
    -Kiem tra cac cot co du lieu thieu
    -Dien gia tri phu hop hoac loai bo cac hang co qua nhieu du lieu thieu
2. Phat hien va sua loi du lieu bat thuong 
    -Tim cac gia tri bat thuong trong cot tuoi(age) cos the la am hoac la qua lon
    -Kiem tra cot thu nhap (income) de phat hien du lieu bi sai
3. Chuyen hoa dang du lieu 
    -Chuyen doi cot sang ngay sinh va dang chuan yyyy/mm/dd
    -Chuyen hoa du lieu trong cot gioi tinh(gender) de chi co 2 gioi tinh hop le la "Male" va "Female"
4. Xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng
    -Xuất dữ liệu sạch
5. Lưu tập dữ liệu đã làm sạch thành tệp mới clean_data.csv